01/part1/doc/README.tex
% Created 2014-08-24 Sun 23:16
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Michael Hunsinger}
\date{\today}
\title{README}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.3.1 (Org mode 8.2.7c)}}
\begin{document}

\maketitle

\section{Summary}
\label{sec-1}
This file goes over how the compiler package and it's implementation are to be
used. This covers from start to end, including installation of Go, setting up
a workspace for the compiler, and compiling the files and running the program.

\section{Install Go}
\label{sec-2}
Download the appropriate installation from Google's Go website,
\url{http://golang.org/doc/install}, there is additional documentation located
on website as well.

\section{Go's Workspace}
\label{sec-3}
Extract files from the tarball into the desired location. Inside the root
folder you will find four directories
\begin{itemize}
\item \texttt{bin} compiled executables, along with sample micro program files
\item \texttt{doc} documentation
\item \texttt{pkg} package objects (the compiler package is located in here)
\item \texttt{src} source files
\begin{itemize}
\item \texttt{compiler} source files pertaining to the compiler package
\item \texttt{main} source files pertaining to the main package (the driver file)
\end{itemize}
\end{itemize}

\section{Compiling Source Files}
\label{sec-4}
There are two steps to compile and the executable; building the compiler
package and then build the executable.
\begin{verbatim}
$ cd ../01/src/compiler
$ go build
$ cd ../main
$ go install
\end{verbatim}
Now there is an executable in the \texttt{bin} folder.

\section{Running the Program}
\label{sec-5}
You can run the executable that was compiled. Ensure you are in the directory
where the \texttt{sample.micro} file is located.
\begin{verbatim}
$ cd ../01/bin
$ ./main
\end{verbatim}

\section{Sample Input and Output}
\label{sec-6}
Input file \texttt{sample.micro}
\begin{verbatim}
BEGIN --SOMETHING UNUSUAL
   READ(A1, New_A, D, B);
   C:= A1 +(New_A - D) - 75;
   New_C:=((B - (7) + (C + D))) - (3 - A1); -- STUPID FORMULA
   WRITE(C, A1 + New_C);
   -- WHAT ABOUT := B + D;
END
\end{verbatim}
Output from \texttt{sample.micro}
\begin{verbatim}
BeginSym ReadSym LParen Id Comma Id Comma Id Comma Id RParen SemiColon Id 
AssignOp Id PlusOp LParen Id MinusOp Id RParen MinusOp IntLiteral SemiColon
Id AssignOp LParen LParen Id MinusOp LParen IntLiteral RParen PlusOp LParen
Id PlusOp Id RParen RParen RParen MinusOp LParen IntLiteral MinusOp Id RParen
SemiColon WriteSym LParen Id Comma Id PlusOp Id RParen SemiColon EndSym
\end{verbatim}
% Emacs 24.3.1 (Org mode 8.2.7c)
\end{document}
